# Importing rerquired library

In [19]:
import pandas as pd
import numpy as np
import seaborn as sns

#  Creating objects

In [2]:
# Creating dataframe using list
lst = ['sun','mon','tues','wed']
df = pd.DataFrame(lst)
df

      0
0   sun
1   mon
2  tues
3   wed

In [5]:
# creating dataframe using dict
dis = {'name':['sandesh','puran','amar', 'saroj'],
      'roll': [1,2,3,4],
      'location':['jhapa','parbat','biratnagar','biratnagar']}
df1 = pd.DataFrame(dis)
df1

      name  roll    location
0  sandesh     1       jhapa
1    puran     2      parbat
2     amar     3  biratnagar
3    saroj     4  biratnagar

## Column Selection

In [10]:
print(df1[['name', 'location', 'roll']])

      name    location  roll
0  sandesh       jhapa     1
1    puran      parbat     2
2     amar  biratnagar     3
3    saroj  biratnagar     4

## Row selection

In [16]:
first_row = df1.loc[3]
print(first_row)

name             saroj
roll                 4
location    biratnagar
Name: 3, dtype: object

In [18]:
second_method = df1.iloc[3]
print(second_method)

name             saroj
roll                 4
location    biratnagar
Name: 3, dtype: object

In [22]:
data = sns.load_dataset('Iris')
data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

## Checking for missing values

In [30]:

data.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [31]:
data.notnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0            True         True          True         True     True
1            True         True          True         True     True
2            True         True          True         True     True
3            True         True          True         True     True
4            True         True          True         True     True
..            ...          ...           ...          ...      ...
145          True         True          True         True     True
146          True         True          True         True     True
147          True         True          True         True     True
148          True         True          True         True     True
149          True         True          True         True     True

[150 rows x 5 columns]

In [33]:
data.isnull().sum().sum()

0

In [34]:
data.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [37]:
data['sepal_length'].isnull().sum()

0

## Filling missing value

In [44]:
data1 = {'first':[100,90,np.nan,95],
       'second':[30,45,56,np.nan],
       'third':[np.nan,40,80,98]}
dat = pd.DataFrame(data1)

In [42]:
dat

   first  second  third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [47]:
# filling missing values using fillna()

data2 = dat.fillna(20)
data2

   first  second  third
0  100.0    30.0   20.0
1   90.0    45.0   40.0
2   20.0    56.0   80.0
3   95.0    20.0   98.0

In [50]:
## Droping missing values

data3=dat.dropna()
data3

   first  second  third
1   90.0    45.0   40.0

In [52]:
## Iterating over rows

for i,j in dat.iterrows():
    print(i,j)
    print()

0 first     100.0
second     30.0
third       NaN
Name: 0, dtype: float64

1 first     90.0
second    45.0
third     40.0
Name: 1, dtype: float64

2 first      NaN
second    56.0
third     80.0
Name: 2, dtype: float64

3 first     95.0
second     NaN
third     98.0
Name: 3, dtype: float64

In [53]:
## Iterating over columns
columns = list(dat)
columns

['first', 'second', 'third']

In [57]:
for i in columns:
    print(dat[i][2])

nan
56.0
80.0

In [60]:
dat['first'].iloc[:3]

0    100.0
1     90.0
2      NaN
Name: first, dtype: float64

In [63]:
dat.second

0    30.0
1    45.0
2    56.0
3     NaN
Name: second, dtype: float64

In [62]:
dat['first']

0    100.0
1     90.0
2      NaN
3     95.0
Name: first, dtype: float64

In [64]:
df1[df1['location']=='biratnagar']

    name  roll    location
2   amar     3  biratnagar
3  saroj     4  biratnagar